nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPwmPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: B2, peripheral: PWM1, signal: 'A, 0', pin_signal: GPIO_EMC_B1_23}
  - {pin_num: J4, peripheral: PWM1, signal: 'A, 1', pin_signal: GPIO_EMC_B1_25}
  - {pin_num: G5, peripheral: PWM1, signal: 'A, 2', pin_signal: GPIO_EMC_B1_27}
  - {pin_num: J5, peripheral: PWM1, signal: 'B, 0', pin_signal: GPIO_EMC_B1_24}
  - {pin_num: J3, peripheral: PWM1, signal: 'B, 1', pin_signal: GPIO_EMC_B1_26}
  - {pin_num: E5, peripheral: PWM1, signal: 'B, 2', pin_signal: GPIO_EMC_B1_28}
  - {pin_num: H4, peripheral: PWM2, signal: 'A, 0', pin_signal: GPIO_EMC_B1_06}
  - {pin_num: F5, peripheral: PWM2, signal: 'A, 1', pin_signal: GPIO_EMC_B1_08}
  - {pin_num: A2, peripheral: PWM2, signal: 'A, 2', pin_signal: GPIO_EMC_B1_10}
  - {pin_num: H3, peripheral: PWM2, signal: 'B, 0', pin_signal: GPIO_EMC_B1_07}
  - {pin_num: A3, peripheral: PWM2, signal: 'B, 1', pin_signal: GPIO_EMC_B1_09}
  - {pin_num: C2, peripheral: PWM2, signal: 'B, 2', pin_signal: GPIO_EMC_B1_11}
  - {pin_num: E6, peripheral: PWM3, signal: 'A, 0', pin_signal: GPIO_EMC_B1_29}
  - {pin_num: D2, peripheral: PWM3, signal: 'A, 1', pin_signal: GPIO_EMC_B1_31}
  - {pin_num: E2, peripheral: PWM3, signal: 'A, 2', pin_signal: GPIO_EMC_B1_33}
  - {pin_num: E3, peripheral: PWM3, signal: 'B, 0', pin_signal: GPIO_EMC_B1_30}
  - {pin_num: D1, peripheral: PWM3, signal: 'B, 1', pin_signal: GPIO_EMC_B1_32}
  - {pin_num: E1, peripheral: PWM3, signal: 'B, 2', pin_signal: GPIO_EMC_B1_34}
  - {pin_num: F3, peripheral: PWM4, signal: 'A, 0', pin_signal: GPIO_EMC_B1_00}
  - {pin_num: G4, peripheral: PWM4, signal: 'A, 1', pin_signal: GPIO_EMC_B1_02}
  - {pin_num: H5, peripheral: PWM4, signal: 'A, 2', pin_signal: GPIO_EMC_B1_04}
  - {pin_num: F2, peripheral: PWM4, signal: 'B, 0', pin_signal: GPIO_EMC_B1_01}
  - {pin_num: E4, peripheral: PWM4, signal: 'B, 1', pin_signal: GPIO_EMC_B1_03}
  - {pin_num: F4, peripheral: PWM4, signal: 'B, 2', pin_signal: GPIO_EMC_B1_05}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPwmPins, assigned for the Cortex-M7F core.
 * Description   : Configures PWM pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPwmPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_00_FLEXPWM4_PWM0_A,  /* GPIO_EMC_B1_00 is configured as FLEXPWM4_PWM0_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_01_FLEXPWM4_PWM0_B,  /* GPIO_EMC_B1_01 is configured as FLEXPWM4_PWM0_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_02_FLEXPWM4_PWM1_A,  /* GPIO_EMC_B1_02 is configured as FLEXPWM4_PWM1_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_03_FLEXPWM4_PWM1_B,  /* GPIO_EMC_B1_03 is configured as FLEXPWM4_PWM1_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_04_FLEXPWM4_PWM2_A,  /* GPIO_EMC_B1_04 is configured as FLEXPWM4_PWM2_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_05_FLEXPWM4_PWM2_B,  /* GPIO_EMC_B1_05 is configured as FLEXPWM4_PWM2_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_06_FLEXPWM2_PWM0_A,  /* GPIO_EMC_B1_06 is configured as FLEXPWM2_PWM0_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_07_FLEXPWM2_PWM0_B,  /* GPIO_EMC_B1_07 is configured as FLEXPWM2_PWM0_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_08_FLEXPWM2_PWM1_A,  /* GPIO_EMC_B1_08 is configured as FLEXPWM2_PWM1_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_09_FLEXPWM2_PWM1_B,  /* GPIO_EMC_B1_09 is configured as FLEXPWM2_PWM1_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_10_FLEXPWM2_PWM2_A,  /* GPIO_EMC_B1_10 is configured as FLEXPWM2_PWM2_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_11_FLEXPWM2_PWM2_B,  /* GPIO_EMC_B1_11 is configured as FLEXPWM2_PWM2_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_23_FLEXPWM1_PWM0_A,  /* GPIO_EMC_B1_23 is configured as FLEXPWM1_PWM0_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_24_FLEXPWM1_PWM0_B,  /* GPIO_EMC_B1_24 is configured as FLEXPWM1_PWM0_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_25_FLEXPWM1_PWM1_A,  /* GPIO_EMC_B1_25 is configured as FLEXPWM1_PWM1_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_26_FLEXPWM1_PWM1_B,  /* GPIO_EMC_B1_26 is configured as FLEXPWM1_PWM1_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_27_FLEXPWM1_PWM2_A,  /* GPIO_EMC_B1_27 is configured as FLEXPWM1_PWM2_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_28_FLEXPWM1_PWM2_B,  /* GPIO_EMC_B1_28 is configured as FLEXPWM1_PWM2_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_29_FLEXPWM3_PWM0_A,  /* GPIO_EMC_B1_29 is configured as FLEXPWM3_PWM0_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_30_FLEXPWM3_PWM0_B,  /* GPIO_EMC_B1_30 is configured as FLEXPWM3_PWM0_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_31_FLEXPWM3_PWM1_A,  /* GPIO_EMC_B1_31 is configured as FLEXPWM3_PWM1_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_32_FLEXPWM3_PWM1_B,  /* GPIO_EMC_B1_32 is configured as FLEXPWM3_PWM1_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_33_FLEXPWM3_PWM2_A,  /* GPIO_EMC_B1_33 is configured as FLEXPWM3_PWM2_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_34_FLEXPWM3_PWM2_B,  /* GPIO_EMC_B1_34 is configured as FLEXPWM3_PWM2_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


