nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUserLedsPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: C7, peripheral: GPIO5, signal: 'gpio_mux_io, 05', pin_signal: GPIO_DISP_B2_04, direction: OUTPUT, pull_up_down_config: Pull_Up, pull_keeper_select: Pull}
  - {pin_num: C9, peripheral: GPIO5, signal: 'gpio_mux_io, 06', pin_signal: GPIO_DISP_B2_05, direction: OUTPUT, pull_up_down_config: Pull_Up, pull_keeper_select: Pull}
  - {pin_num: C6, peripheral: GPIO5, signal: 'gpio_mux_io, 07', pin_signal: GPIO_DISP_B2_06, direction: OUTPUT, pull_up_down_config: Pull_Up, pull_keeper_select: Pull}
  - {pin_num: D6, peripheral: GPIO5, signal: 'gpio_mux_io, 08', pin_signal: GPIO_DISP_B2_07, direction: OUTPUT, pull_up_down_config: Pull_Up}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUserLedsPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUserLedsPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  /* GPIO configuration of USER_LED1_BOOT_CFG10 on GPIO_DISP_B2_04 (pin C7) */
  gpio_pin_config_t USER_LED1_BOOT_CFG10_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_DISP_B2_04 (pin C7) */
  GPIO_PinInit(GPIO5, 5U, &USER_LED1_BOOT_CFG10_config);

  /* GPIO configuration of USER_LED2_BOOT_CFG11 on GPIO_DISP_B2_05 (pin C9) */
  gpio_pin_config_t USER_LED2_BOOT_CFG11_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_DISP_B2_05 (pin C9) */
  GPIO_PinInit(GPIO5, 6U, &USER_LED2_BOOT_CFG11_config);

  /* GPIO configuration of USER_LED3 on GPIO_DISP_B2_06 (pin C6) */
  gpio_pin_config_t USER_LED3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_DISP_B2_06 (pin C6) */
  GPIO_PinInit(GPIO5, 7U, &USER_LED3_config);

  /* GPIO configuration of USER_LED4 on GPIO_DISP_B2_07 (pin D6) */
  gpio_pin_config_t USER_LED4_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_DISP_B2_07 (pin D6) */
  GPIO_PinInit(GPIO5, 8U, &USER_LED4_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_04_GPIO_MUX5_IO05,  /* GPIO_DISP_B2_04 is configured as GPIO_MUX5_IO05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_05_GPIO_MUX5_IO06,  /* GPIO_DISP_B2_05 is configured as GPIO_MUX5_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_06_GPIO_MUX5_IO07,  /* GPIO_DISP_B2_06 is configured as GPIO_MUX5_IO07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_07_GPIO_MUX5_IO08,  /* GPIO_DISP_B2_07 is configured as GPIO_MUX5_IO08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_04_GPIO_MUX5_IO05,  /* GPIO_DISP_B2_04 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_05_GPIO_MUX5_IO06,  /* GPIO_DISP_B2_05 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_06_GPIO_MUX5_IO07,  /* GPIO_DISP_B2_06 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_07_GPIO_MUX5_IO08,  /* GPIO_DISP_B2_07 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}


