nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDigitalOutputPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: E8, peripheral: GPIO5, signal: 'gpio_mux_io, 01', pin_signal: GPIO_DISP_B2_00, direction: OUTPUT, pull_up_down_config: Pull_Up, pull_keeper_select: Pull}
  - {pin_num: F8, peripheral: GPIO5, signal: 'gpio_mux_io, 02', pin_signal: GPIO_DISP_B2_01, direction: OUTPUT, pull_up_down_config: Pull_Up, pull_keeper_select: Pull}
  - {pin_num: E9, peripheral: GPIO5, signal: 'gpio_mux_io, 03', pin_signal: GPIO_DISP_B2_02, direction: OUTPUT, pull_up_down_config: Pull_Up, pull_keeper_select: Pull}
  - {pin_num: D7, peripheral: GPIO5, signal: 'gpio_mux_io, 04', pin_signal: GPIO_DISP_B2_03, direction: OUTPUT, pull_up_down_config: Pull_Up, pull_keeper_select: Pull}
  - {pin_num: R10, peripheral: GPIO13, signal: 'gpio_io, 03', pin_signal: GPIO_SNVS_00, direction: OUTPUT}
  - {pin_num: P10, peripheral: GPIO13, signal: 'gpio_io, 04', pin_signal: GPIO_SNVS_01, direction: OUTPUT}
  - {pin_num: L9, peripheral: GPIO13, signal: 'gpio_io, 05', pin_signal: GPIO_SNVS_02, direction: OUTPUT}
  - {pin_num: M10, peripheral: GPIO13, signal: 'gpio_io, 06', pin_signal: GPIO_SNVS_03, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDigitalOutputPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDigitalOutputPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  /* GPIO configuration of DIG_OUT_0_BOOT_CFG6 on GPIO_DISP_B2_00 (pin E8) */
  gpio_pin_config_t DIG_OUT_0_BOOT_CFG6_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_DISP_B2_00 (pin E8) */
  GPIO_PinInit(GPIO5, 1U, &DIG_OUT_0_BOOT_CFG6_config);

  /* GPIO configuration of DIG_OUT_1_BOOT_CFG7 on GPIO_DISP_B2_01 (pin F8) */
  gpio_pin_config_t DIG_OUT_1_BOOT_CFG7_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_DISP_B2_01 (pin F8) */
  GPIO_PinInit(GPIO5, 2U, &DIG_OUT_1_BOOT_CFG7_config);

  /* GPIO configuration of DIG_OUT_2_BOOT_CFG8 on GPIO_DISP_B2_02 (pin E9) */
  gpio_pin_config_t DIG_OUT_2_BOOT_CFG8_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_DISP_B2_02 (pin E9) */
  GPIO_PinInit(GPIO5, 3U, &DIG_OUT_2_BOOT_CFG8_config);

  /* GPIO configuration of DIG_OUT_3_BOOT_CFG9 on GPIO_DISP_B2_03 (pin D7) */
  gpio_pin_config_t DIG_OUT_3_BOOT_CFG9_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_DISP_B2_03 (pin D7) */
  GPIO_PinInit(GPIO5, 4U, &DIG_OUT_3_BOOT_CFG9_config);

  /* GPIO configuration of DIG_OUT_4_SNVS on GPIO_SNVS_00_DIG (pin R10) */
  gpio_pin_config_t DIG_OUT_4_SNVS_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_00_DIG (pin R10) */
  GPIO_PinInit(GPIO13, 3U, &DIG_OUT_4_SNVS_config);

  /* GPIO configuration of DIG_OUT_5_SNVS on GPIO_SNVS_01_DIG (pin P10) */
  gpio_pin_config_t DIG_OUT_5_SNVS_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_01_DIG (pin P10) */
  GPIO_PinInit(GPIO13, 4U, &DIG_OUT_5_SNVS_config);

  /* GPIO configuration of DIG_OUT_6_SNVS on GPIO_SNVS_02_DIG (pin L9) */
  gpio_pin_config_t DIG_OUT_6_SNVS_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_02_DIG (pin L9) */
  GPIO_PinInit(GPIO13, 5U, &DIG_OUT_6_SNVS_config);

  /* GPIO configuration of DIG_OUT_7_SNVS on GPIO_SNVS_03_DIG (pin M10) */
  gpio_pin_config_t DIG_OUT_7_SNVS_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_03_DIG (pin M10) */
  GPIO_PinInit(GPIO13, 6U, &DIG_OUT_7_SNVS_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_00_GPIO_MUX5_IO01,  /* GPIO_DISP_B2_00 is configured as GPIO_MUX5_IO01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_01_GPIO_MUX5_IO02,  /* GPIO_DISP_B2_01 is configured as GPIO_MUX5_IO02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_02_GPIO_MUX5_IO03,  /* GPIO_DISP_B2_02 is configured as GPIO_MUX5_IO03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_03_GPIO_MUX5_IO04,  /* GPIO_DISP_B2_03 is configured as GPIO_MUX5_IO04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_00_DIG_GPIO13_IO03,    /* GPIO_SNVS_00_DIG is configured as GPIO13_IO03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_01_DIG_GPIO13_IO04,    /* GPIO_SNVS_01_DIG is configured as GPIO13_IO04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_02_DIG_GPIO13_IO05,    /* GPIO_SNVS_02_DIG is configured as GPIO13_IO05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_03_DIG_GPIO13_IO06,    /* GPIO_SNVS_03_DIG is configured as GPIO13_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_00_GPIO_MUX5_IO01,  /* GPIO_DISP_B2_00 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_01_GPIO_MUX5_IO02,  /* GPIO_DISP_B2_01 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_02_GPIO_MUX5_IO03,  /* GPIO_DISP_B2_02 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_03_GPIO_MUX5_IO04,  /* GPIO_DISP_B2_03 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}


