nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitWdogPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: A4, peripheral: WDOG1, signal: wdog_wdog_b, pin_signal: GPIO_DISP_B2_15}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitWdogPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitWdogPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_15_WDOG1_B,         /* GPIO_DISP_B2_15 is configured as WDOG1_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitClockOutputPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: K1, peripheral: CCM, signal: CLKO1, pin_signal: GPIO_EMC_B1_40}
  - {pin_num: L1, peripheral: CCM, signal: CLKO2, pin_signal: GPIO_EMC_B1_41}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitClockOutputPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitClockOutputPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_40_CCM_CLKO1,        /* GPIO_EMC_B1_40 is configured as CCM_CLKO1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_41_CCM_CLKO2,        /* GPIO_EMC_B1_41 is configured as CCM_CLKO2 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
MC_InitXbar:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {peripheral: ADC_ETC, signal: 'XBAR0_TRIG, 0', pin_signal: FLEXPWM1_PWM0_OUT_TRIG1}
  - {peripheral: ADC_ETC, signal: 'XBAR0_TRIG, 1', pin_signal: FLEXPWM1_PWM1_OUT_TRIG0}
  - {peripheral: ADC_ETC, signal: 'XBAR0_TRIG, 2', pin_signal: FLEXPWM1_PWM1_OUT_TRIG1}
  - {peripheral: ADC_ETC, signal: 'XBAR0_TRIG, 3', pin_signal: FLEXPWM1_PWM2_OUT_TRIG0}
  - {peripheral: PWM2, signal: 'EXT_SYNC, 0', pin_signal: FLEXPWM1_PWM3_OUT_TRIG0}
  - {peripheral: PWM2, signal: 'EXT_SYNC, 1', pin_signal: FLEXPWM1_PWM3_OUT_TRIG0}
  - {peripheral: PWM2, signal: 'EXT_SYNC, 2', pin_signal: FLEXPWM1_PWM3_OUT_TRIG0}
  - {peripheral: PWM3, signal: 'EXT_SYNC, 0', pin_signal: FLEXPWM1_PWM3_OUT_TRIG1}
  - {peripheral: PWM3, signal: 'EXT_SYNC, 1', pin_signal: FLEXPWM1_PWM3_OUT_TRIG1}
  - {peripheral: PWM3, signal: 'EXT_SYNC, 2', pin_signal: FLEXPWM1_PWM3_OUT_TRIG1}
  - {peripheral: PWM4, signal: 'EXT_SYNC, 0', pin_signal: FLEXPWM1_PWM0_OUT_TRIG0}
  - {peripheral: PWM4, signal: 'EXT_SYNC, 1', pin_signal: FLEXPWM1_PWM0_OUT_TRIG0}
  - {peripheral: PWM4, signal: 'EXT_SYNC, 2', pin_signal: FLEXPWM1_PWM0_OUT_TRIG0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : MC_InitXbar, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void MC_InitXbar(void) {
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* LPCG on: LPCG is ON. */

  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputFlexpwm1Pwm3OutTrig0, kXBARA1_OutputFlexpwm2Pwm0ExtSync); /* FLEXPWM1_PWM3_OUT_TRIG0 output assigned to XBARA1_IN80 input is connected to XBARA1_OUT67 output assigned to FLEXPWM2_PWM0_EXT_SYNC */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputFlexpwm1Pwm3OutTrig0, kXBARA1_OutputFlexpwm2Pwm1ExtSync); /* FLEXPWM1_PWM3_OUT_TRIG0 output assigned to XBARA1_IN80 input is connected to XBARA1_OUT68 output assigned to FLEXPWM2_PWM1_EXT_SYNC */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputFlexpwm1Pwm3OutTrig0, kXBARA1_OutputFlexpwm2Pwm2ExtSync); /* FLEXPWM1_PWM3_OUT_TRIG0 output assigned to XBARA1_IN80 input is connected to XBARA1_OUT69 output assigned to FLEXPWM2_PWM2_EXT_SYNC */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputFlexpwm1Pwm3OutTrig1, kXBARA1_OutputFlexpwm3Pwm0ExtSync); /* FLEXPWM1_PWM3_OUT_TRIG1 output assigned to XBARA1_IN81 input is connected to XBARA1_OUT80 output assigned to FLEXPWM3_PWM0_EXT_SYNC */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputFlexpwm1Pwm3OutTrig1, kXBARA1_OutputFlexpwm3Pwm1ExtSync); /* FLEXPWM1_PWM3_OUT_TRIG1 output assigned to XBARA1_IN81 input is connected to XBARA1_OUT81 output assigned to FLEXPWM3_PWM1_EXT_SYNC */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputFlexpwm1Pwm3OutTrig1, kXBARA1_OutputFlexpwm3Pwm2ExtSync); /* FLEXPWM1_PWM3_OUT_TRIG1 output assigned to XBARA1_IN81 input is connected to XBARA1_OUT82 output assigned to FLEXPWM3_PWM2_EXT_SYNC */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputFlexpwm1Pwm0OutTrig0, kXBARA1_OutputFlexpwm4Pwm0ExtSync); /* FLEXPWM1_PWM0_OUT_TRIG0 output assigned to XBARA1_IN74 input is connected to XBARA1_OUT87 output assigned to FLEXPWM4_PWM0_EXT_SYNC */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputFlexpwm1Pwm0OutTrig0, kXBARA1_OutputFlexpwm4Pwm1ExtSync); /* FLEXPWM1_PWM0_OUT_TRIG0 output assigned to XBARA1_IN74 input is connected to XBARA1_OUT88 output assigned to FLEXPWM4_PWM1_EXT_SYNC */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputFlexpwm1Pwm0OutTrig0, kXBARA1_OutputFlexpwm4Pwm2ExtSync); /* FLEXPWM1_PWM0_OUT_TRIG0 output assigned to XBARA1_IN74 input is connected to XBARA1_OUT89 output assigned to FLEXPWM4_PWM2_EXT_SYNC */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputFlexpwm1Pwm0OutTrig1, kXBARA1_OutputAdcEtc0Coco0); /* FLEXPWM1_PWM0_OUT_TRIG1 output assigned to XBARA1_IN75 input is connected to XBARA1_OUT155 output assigned to ADC_ETC0_COCO0 */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputFlexpwm1Pwm1OutTrig0, kXBARA1_OutputAdcEtc0Coco1); /* FLEXPWM1_PWM1_OUT_TRIG0 output assigned to XBARA1_IN76 input is connected to XBARA1_OUT156 output assigned to ADC_ETC0_COCO1 */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputFlexpwm1Pwm1OutTrig1, kXBARA1_OutputAdcEtc0Coco2); /* FLEXPWM1_PWM1_OUT_TRIG1 output assigned to XBARA1_IN77 input is connected to XBARA1_OUT157 output assigned to ADC_ETC0_COCO2 */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputFlexpwm1Pwm2OutTrig0, kXBARA1_OutputAdcEtc0Coco3); /* FLEXPWM1_PWM2_OUT_TRIG0 output assigned to XBARA1_IN78 input is connected to XBARA1_OUT158 output assigned to ADC_ETC0_COCO3 */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
